{
  "Classroom Teaching": "<p>These are a selection of classroom resources I prepared. These range from worksheets to units. As I have only worked as a classroom teacher within Welsh Education, all of these resources are Welsh Medium.</p>",
    "Gwersi Hidlo": "<p>Filtration Lessons. These resources include a lesson plan, a powerpoint, and a worksheet for the learners.</p>",
    "Gwersi Mater": "<p>Matter Lessons. These resources include a lesson plan, several worksheets for advanced classes and a scaffolded workbook for classes who require additional support.</p>",
    "Unedau": "<p>These are examples of some of the units I prepared during one of my teaching posts. Along with the head of science I helped completely refresh the physics curriculum within the school.</p>",

  "Dissertations": "<p>These are the dissertations I have written for each of my university degrees.</p>",
    "PGCE": "<p>The dissertation for my PGCE - 'An Investigation into Utilising ‘Inference Squares’ in Tutoring Pupils to Use the Techniques Required in Answering PISA Questions'. <br><br> I investigated using inference squares in the classroom as a method of deepening the learners understanding of a question posed to them. The questions used were sourced from PISA tests so that a baseline could be established and deeper comparisons made.</p>",
    "Physics BSc": "<p>The dissertation for my BSc - 'A Study Into the Accountability of Evaporation in the Mass Reduction of the Aral Sea'. <br><br> I used satellite imagery to estimate the reduction of the volume of water in the Aral Sea over a 30 year period. The hypothesis was that water could not have simply evaporated and absorption into the soil must have played a significant role.</p>",
    "Medical Radiation Physics MSc": "<p>The dissertation for my MSc - 'A report evaluating the risk of unintended exposures at SBUHB using voluntarily reported radiotherapy errors'. <br><br> I chose this dissertation with the knowledge that it would be internally published and distributed amongst staff within Swansea Bay University Health Board. In this report I aimed to quantify and qualify the nature of reported radiotherapy errors within SBUHB. This required careful analysis to look beyond the data, as I was only analysing the voluntary reports made and could not account for any unreported errors.</p>",

  "Mad Science": "<p>These are a set of resources I prepared at Mad Science. Many of my contributions at Mad Science had no documentation as they were physical activities.</p>",
    "Sustainability Lab": "<p>The Sustainability Lab was a brand new workshop developed in collaboration with GENeco in Bristol. The aim of the workshops was to make young people aware of sustainability. I personally developed the experiments and flow of each of these workshops.</p>",

  "Scratch Programs": "<p>These are a selection of Scratch programs I have written. Some of these are to be used by learners, while others are to be coded by learners (potentially with the use of templates). <br> The code for these can all be viewed at my Scratch repo: <a href='https://scratch.mit.edu/users/DanTechnocamps'>scratch.mit.edu/users/DanTechnocamps</a></p>",

  "Technocamps": "<p>These are a selection of Computer Science resources I prepared at Technocamps. These range from materials for school workshops, to courses prepared for adult learners. Most of these resources are provided in both Welsh & English Medium, unless the translation was unnecessary.</p>",
    "External": "<p>These are resources prepared by myself at Technocamps on behalf of other organisations.</p>",
      "NHS - MatPlotLib": "<p>These resources are for a short 2-day course we ran for data analysts at the NHS, providing them with an insight into using Python for data science.</p>",
      "Big Pit (Amgueddfa Cymru)": "<p>This is a resource prepared by myself at Technocamps in collaboration with Amgueddfa Cymru. Specifically they approached us to develop digital resources for a workshop in their <a href='https://museum.wales/bigpit/'>Big Pit</a> museum on the advancement of technology within the mining industry.</p>",
    "Teacher Training": "<p>These resources are all for the purpose of teacher training. They range from small sessions to year long courses.</p>",
      "EAS Hybrid Secondary Course": "<p>This is a year long course provided by Technocamps (funded by EAS) for Secondary Education Computer Science teachers. The course is aimed to specifically upskill teachers and grow their confidence in delivering the computer science curriculum.</p>",
      "Education Conference 2022 Resources": "<p>These are resources developed by me for the 2022 Computer Science Education Conference held by Technocamps. They focus on 2 core ideas to use in the classroom - Machine Learning and Programming. </p>",
        "Machine Learning": "<p>The Machine Learning resources focus on using the tool <a href='https://machinelearningforkids.co.uk/?lang=en'>Machine Learning for Kids</a> in both Primary and Secondary environments.</p>",
        "Programming Across CFW": "<p>The Programming resources focus on the ways that programming can be implemented across the Curriculum For Wales (i.e. in every subject area). These focus on using Scratch in Primary and Python in Secondary environments.</p>",
      "Education Conference 2023 Resources": "<p>These are resources developed by me for the 2023 Computer Science Education Conference held by Technocamps. They focus on raising awareness of Cyber Security within Secondary education, to demonstrate to the learners how vulnerable systems can be.</p>",
      "Education Conference 2024 Resources": "<p>These are resources developed by me for the 2024 Computer Science Education Conference held by Technocamps. They focus on encouraging Primary Education teachers to use the <a href='https://microbit.org'>micro:bit</a> for more than simple programming, but to leverage its capabilities in science investigations. This includes using it both for Data Logging and Machine Learning models.</p>",
      "Education Conference 2025 Resources": "<p>These are resources developed by me for the 2025 Computer Science Education Conference held by Technocamps. They focus on upskilling Secondary Education Computer Science teachers in their Python knowledge. This was in preparation for the new Computer Science curriculum that heavily focuses on Python, and has a lot more complexity than before.</p>",
      "Hwb DigiFest": "<p>These are resources developed by me to be used as part of the Hwb DigiFest, an online day of teacher training hosted by <a href='https://hwb.gov.wales'>Hwb</a>. They demonstrate to teachers the <a href='https://machinelearningforkids.co.uk/?lang=en'>Machine Learning for Kids</a> and <a href='https://arcade.makecode.com/'>MakeCode Arcade</a> platforms.</p>",
      "Hwb Presents": "<p>This is a resource developed by me to be used in Hwb Presents, a video series of short teacher training sessions hosted by <a href='https://hwb.gov.wales'>Hwb</a>. It educates teachers on the basic functions and simple programming they can do on their <a href='https://microbit.org'>micro:bits</a>.</p>",
    "Workshops": "<p>These are resources developed by me to be used in school workshops by Technocamps.</p>",
      "Arduino": "<p>In this workshop learners learn what an <a href='https://www.arduino.cc'>Arduino</a> is and how they can use it as a micro-controller. They do this by programming smart lights that are controlled by the surrounding lighting conditions.</p>",
      "Networks and Communications": "<p>This workshop was requested by a local council, as they had a serious problem where some people were cutting down 5G towers... The purpose of this workshop is to educate young people on what a network is, how they work and why we need them. By taking this concept one question at a time we explain the basis of the EM-Spectrum, and consequentially why 5G is not a dangerous invention. Also, the learners should understand why the rapid spread of 5G towers occurred, as their range is so limited compared to previous networks.</p>",
      "Python Hangman": "<p>This workshop aims to make learning Python a little more exciting than making an interest rate calculator. In this small program learners cover the concepts of data structures, iteration and functions while making something fun.</p>",
      "Scratch Solar System": "<p>In this workshop learners learn about the solar system, research the sizes and orbital periods of planets, and use that information to build their own accurate model of the solar system.</p>",
      "Snap! Climate Change": "<p>This workshop aims to teach the fundamentals of data analysis and visualisation at a relatively young age. By using <a href'https://snap.berkeley.edu'>Snap!</a> learners can use block based programming to filter, group and map their data to find their own correlations. Here, learners use the global climate datasets to investigate the validity of climate change.</p>",
      "Snap! Cybercrime": "<p>This workshop was requested by the <a href='https://www.ncsc.gov.uk'>NCSC</a> to help educate learners about the dangers of cybercrime. The workshop aims to teach the fundamentals of data analysis and visualisation at a relatively young age. By using <a href'https://snap.berkeley.edu'>Snap!</a> learners can use block based programming to filter, group and map their data to find their own correlations. Here, learners use the UK Cybercrime datasets to investigate the characteristics (age, sex etc.) of those who commit cyber crimes.</p>",
      "Text Adventure OOP": "<p>This workshop aims to make learning Object Oriented Programming a little more exciting than learning classes through examples like animals or people. In this program, learners begin to create a text adventure game using the object oriented paradigm - hopefully they will continue with the project in their own time.</p>"
}